<!DOCTYPE HTML>
<html lang="zh-hans" >
    <!-- Start book 数据结构 -->
    <head>
        <!-- head:start -->
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>顺序表 | 数据结构</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="../gitbook/style.css">
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-toggle-chapters/toggle.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-splitter/splitter.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-tbfed-pagefooter/footer.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-emphasize/plugin.css">
        
    
        
        <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/css/bootstrap.min.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-mcqx/mcqx.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-katex/katex.min.css">
        
    
        
        <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.6/css/bootstrap.min.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-sectionx/sectionx.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="../files/lianbiao.html" />
    
    
    <link rel="prev" href="../files/readme.html" />
    

        <!-- head:end -->
    </head>
    <body>
        <!-- body:start -->
        
    <div class="book"
        data-level="2"
        data-chapter-title="顺序表"
        data-filepath="files/sxb.md"
        data-basepath=".."
        data-revision="Sat Mar 16 2019 00:38:44 GMT+0800 (中国标准时间)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="../index.html">
                
                        <i class="fa fa-check"></i>
                        
                        介绍
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="files/readme.html">
            
                
                    <a href="../files/readme.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        数据结构
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="2" data-path="files/sxb.html">
            
                
                    <a href="../files/sxb.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        顺序表
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="files/lianbiao.html">
            
                
                    <a href="../files/lianbiao.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        链表
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="3.1" data-path="files/lianbiao01.html">
            
                
                    <a href="../files/lianbiao01.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.1.</b>
                        
                        单向链表
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="files/lianbiao02.html">
            
                
                    <a href="../files/lianbiao02.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.2.</b>
                        
                        单向循环链表
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="files/lianbiao03.html">
            
                
                    <a href="../files/lianbiao03.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.3.</b>
                        
                        双向链表
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="4" data-path="files/zhan.html">
            
                
                    <a href="../files/zhan.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        栈
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="files/duilie.html">
            
                
                    <a href="../files/duilie.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        队列
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    本书使用 GitBook 发布
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../" >数据结构</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x987A;&#x5E8F;&#x8868;">&#x987A;&#x5E8F;&#x8868;</h1>
<p>&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x5C06;&#x4E00;&#x7EC4;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x540C;&#x4E3A;&#x67D0;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#xFF09;&#x6570;&#x636E;&#x5143;&#x7D20;&#x4F5C;&#x4E3A;&#x6574;&#x4F53;&#x7BA1;&#x7406;&#x548C;&#x4F7F;&#x7528;&#xFF0C;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x8FD9;&#x79CD;&#x5143;&#x7D20;&#x7EC4;&#xFF0C;&#x7528;&#x53D8;&#x91CF;&#x8BB0;&#x5F55;&#x5B83;&#x4EEC;&#xFF0C;&#x4F20;&#x8FDB;&#x4F20;&#x51FA;&#x51FD;&#x6570;&#x7B49;&#x3002;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x5143;&#x7D20;&#x4E2A;&#x6570;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF08;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x6216;&#x5220;&#x9664;&#x5143;&#x7D20;&#xFF09;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x9700;&#x6C42;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4FBF;&#x662F;&#x5C06;&#x8FD9;&#x6837;&#x4E00;&#x7EC4;&#x5143;&#x7D20;&#x770B;&#x6210;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#xFF0C;&#x7528;&#x5143;&#x7D20;&#x5728;&#x5E8F;&#x5217;&#x91CC;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x987A;&#x5E8F;&#xFF0C;&#x8868;&#x793A;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x67D0;&#x79CD;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6216;&#x8005;&#x8868;&#x793A;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x7684;&#x67D0;&#x79CD;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x7EC4;&#x5E8F;&#x5217;&#x5143;&#x7D20;&#x7684;&#x7EC4;&#x7EC7;&#x5F62;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x62BD;&#x8C61;&#x4E3A;&#x7EBF;&#x6027;&#x8868;&#x3002;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x8868;&#x662F;&#x67D0;&#x7C7B;&#x5143;&#x7D20;&#x7684;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#xFF0C;&#x8FD8;&#x8BB0;&#x5F55;&#x7740;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x79CD;&#x987A;&#x5E8F;&#x5173;&#x7CFB;&#x3002;&#x7EBF;&#x6027;&#x8868;&#x662F;&#x6700;&#x57FA;&#x672C;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E4B;&#x4E00;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x7A0B;&#x5E8F;&#x4E2D;&#x5E94;&#x7528;&#x975E;&#x5E38;&#x5E7F;&#x6CDB;&#xFF0C;&#x5B83;&#x8FD8;&#x7ECF;&#x5E38;&#x88AB;&#x7528;&#x4F5C;&#x66F4;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x5B9E;&#x73B0;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x6839;&#x636E;&#x7EBF;&#x6027;&#x8868;&#x7684;&#x5B9E;&#x9645;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#xFF0C;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#x5B9E;&#x73B0;&#x6A21;&#x578B;&#xFF1A;</p>
<ul>
<li><strong>&#x987A;&#x5E8F;&#x8868;</strong>&#xFF0C;&#x5C06;&#x5143;&#x7D20;&#x987A;&#x5E8F;&#x5730;&#x5B58;&#x653E;&#x5728;&#x4E00;&#x5757;&#x8FDE;&#x7EED;&#x7684;&#x5B58;&#x50A8;&#x533A;&#x91CC;&#xFF0C;&#x5143;&#x7D20;&#x95F4;&#x7684;&#x987A;&#x5E8F;&#x5173;&#x7CFB;&#x7531;&#x5B83;&#x4EEC;&#x7684;&#x5B58;&#x50A8;&#x987A;&#x5E8F;&#x81EA;&#x7136;&#x8868;&#x793A;&#x3002;</li>
<li><strong>&#x94FE;&#x8868;</strong>&#xFF0C;&#x5C06;&#x5143;&#x7D20;&#x5B58;&#x653E;&#x5728;&#x901A;&#x8FC7;&#x94FE;&#x63A5;&#x6784;&#x9020;&#x8D77;&#x6765;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x5B58;&#x50A8;&#x5757;&#x4E2D;&#x3002;</li>
</ul>
<h2 id="1&#x987A;&#x5E8F;&#x8868;&#x7684;&#x57FA;&#x672C;&#x5F62;&#x5F0F;">1.&#x987A;&#x5E8F;&#x8868;&#x7684;&#x57FA;&#x672C;&#x5F62;&#x5F0F;</h2>
<table>
<thead>
<tr>
<th>a&#x987A;&#x5E8F;&#x8868;&#x57FA;&#x672C;&#x5E03;&#x5C40;</th>
<th>b&#x5143;&#x7D20;&#x5916;&#x7F6E;&#x987A;&#x5E8F;&#x8868;</th>
</tr>
</thead>
<tbody>
<tr>
<td><img src="../images/shxb.png" alt="img"></td>
<td><img src="../images/shxb1.png" alt="img"></td>
</tr>
</tbody>
</table>
<p>&#x56FE;a&#x8868;&#x793A;&#x7684;&#x662F;&#x987A;&#x5E8F;&#x8868;&#x7684;&#x57FA;&#x672C;&#x5F62;&#x5F0F;&#xFF0C;&#x6570;&#x636E;&#x5143;&#x7D20;&#x672C;&#x8EAB;&#x8FDE;&#x7EED;&#x5B58;&#x50A8;&#xFF0C;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x6240;&#x5360;&#x7684;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x5927;&#x5C0F;&#x56FA;&#x5B9A;&#x76F8;&#x540C;&#xFF0C;&#x5143;&#x7D20;&#x7684;&#x4E0B;&#x6807;&#x662F;&#x5176;&#x903B;&#x8F91;&#x5730;&#x5740;&#xFF0C;&#x800C;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x7684;&#x7269;&#x7406;&#x5730;&#x5740;&#xFF08;&#x5B9E;&#x9645;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF09;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B58;&#x50A8;&#x533A;&#x7684;&#x8D77;&#x59CB;&#x5730;&#x5740;Loc(e0)&#x52A0;&#x4E0A;&#x903B;&#x8F91;&#x5730;&#x5740;&#xFF08;&#x7B2C;i&#x4E2A;&#x5143;&#x7D20;&#xFF09;&#x4E0E;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x5927;&#x5C0F;&#xFF08;c&#xFF09;&#x7684;&#x4E58;&#x79EF;&#x8BA1;&#x7B97;&#x800C;&#x5F97;&#xFF0C;&#x5373;&#xFF1A; <strong>Loc(ei) = Loc(e0) + c*i</strong> &#x8BBF;&#x95EE;&#x6307;&#x5B9A;&#x5143;&#x7D20;&#x65F6;&#x65E0;&#x9700;&#x4ECE;&#x5934;&#x904D;&#x5386;&#xFF0C;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x4FBF;&#x53EF;&#x83B7;&#x5F97;&#x5BF9;&#x5E94;&#x5730;&#x5740;&#xFF0C;&#x5176;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x4E3A;O(1)&#x3002; &#x5982;&#x679C;&#x5143;&#x7D20;&#x7684;&#x5927;&#x5C0F;&#x4E0D;&#x7EDF;&#x4E00;&#xFF0C;&#x5219;&#x987B;&#x91C7;&#x7528;&#x56FE;b&#x7684;&#x5143;&#x7D20;&#x5916;&#x7F6E;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x5C06;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x5143;&#x7D20;&#x53E6;&#x884C;&#x5B58;&#x50A8;&#xFF0C;&#x800C;&#x987A;&#x5E8F;&#x8868;&#x4E2D;&#x5404;&#x5355;&#x5143;&#x4F4D;&#x7F6E;&#x4FDD;&#x5B58;&#x5BF9;&#x5E94;&#x5143;&#x7D20;&#x7684;&#x5730;&#x5740;&#x4FE1;&#x606F;&#xFF08;&#x5373;&#x94FE;&#x63A5;&#xFF09;&#x3002;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x94FE;&#x63A5;&#x6240;&#x9700;&#x7684;&#x5B58;&#x50A8;&#x91CF;&#x76F8;&#x540C;&#xFF0C;&#x901A;&#x8FC7;&#x4E0A;&#x8FF0;&#x516C;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x51FA;&#x5143;&#x7D20;&#x94FE;&#x63A5;&#x7684;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#xFF0C;&#x800C;&#x540E;&#x987A;&#x7740;&#x94FE;&#x63A5;&#x627E;&#x5230;&#x5B9E;&#x9645;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x56FE;b&#x4E2D;&#x7684;c&#x4E0D;&#x518D;&#x662F;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x800C;&#x662F;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x5730;&#x5740;&#x6240;&#x9700;&#x7684;&#x5B58;&#x50A8;&#x91CF;&#xFF0C;&#x8FD9;&#x4E2A;&#x91CF;&#x901A;&#x5E38;&#x5F88;&#x5C0F;&#x3002; &#x56FE;b&#x8FD9;&#x6837;&#x7684;&#x987A;&#x5E8F;&#x8868;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x5BF9;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#x3002;</p>
<h2 id="2&#x987A;&#x5E8F;&#x8868;&#x7684;&#x7ED3;&#x6784;&#x4E0E;&#x5B9E;&#x73B0;">2.&#x987A;&#x5E8F;&#x8868;&#x7684;&#x7ED3;&#x6784;&#x4E0E;&#x5B9E;&#x73B0;</h2>
<h3 id="1&#x987A;&#x5E8F;&#x8868;&#x7684;&#x7ED3;&#x6784;">1).&#x987A;&#x5E8F;&#x8868;&#x7684;&#x7ED3;&#x6784;</h3>
<p>&#x4E00;&#x4E2A;&#x987A;&#x5E8F;&#x8868;&#x7684;&#x5B8C;&#x6574;&#x4FE1;&#x606F;&#x5305;&#x62EC;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x8868;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x96C6;&#x5408;&#xFF0C;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x4E3A;&#x5B9E;&#x73B0;&#x6B63;&#x786E;&#x64CD;&#x4F5C;&#x800C;&#x9700;&#x8BB0;&#x5F55;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5373;&#x6709;&#x5173;&#x8868;&#x7684;&#x6574;&#x4F53;&#x60C5;&#x51B5;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x4FE1;&#x606F;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x533A;&#x57DF;&#x7684;<strong>&#x5BB9;&#x91CF;</strong>&#x548C;&#x5F53;&#x524D;&#x8868;&#x4E2D;&#x7684;<strong>&#x5143;&#x7D20;&#x4E2A;&#x6570;</strong>&#x4E24;&#x9879;&#x3002;</p>
<h3 id="2&#x987A;&#x5E8F;&#x8868;&#x7684;&#x4E24;&#x79CD;&#x57FA;&#x672C;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;">2).&#x987A;&#x5E8F;&#x8868;&#x7684;&#x4E24;&#x79CD;&#x57FA;&#x672C;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;</h3>
<table>
<thead>
<tr>
<th>a&#x4E00;&#x4F53;&#x5F0F;&#x7ED3;&#x6784;</th>
<th>b&#x5206;&#x79BB;&#x5F0F;&#x7ED3;&#x6784;</th>
</tr>
</thead>
<tbody>
<tr>
<td><img src="../images/shxb3.png" alt="img"></td>
<td><img src="../images/shxb4.png" alt="img"></td>
</tr>
</tbody>
</table>
<ul>
<li><p>&#x4E00;&#x4F53;&#x5F0F;&#x7ED3;&#x6784;&#x5B58;&#x50A8;&#x8868;&#x4FE1;&#x606F;&#x7684;&#x5355;&#x5143;&#x4E0E;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x533A;&#x4EE5;&#x8FDE;&#x7EED;&#x7684;&#x65B9;&#x5F0F;&#x5B89;&#x6392;&#x5728;&#x4E00;&#x5757;&#x5B58;&#x50A8;&#x533A;&#x91CC;&#xFF0C;&#x4E24;&#x90E8;&#x5206;&#x6570;&#x636E;&#x7684;&#x6574;&#x4F53;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x987A;&#x5E8F;&#x8868;&#x5BF9;&#x8C61;&#x3002;</p>
</li>
<li><p>&#x4E00;&#x4F53;&#x5F0F;&#x7ED3;&#x6784;&#x6574;&#x4F53;&#x6027;&#x5F3A;&#xFF0C;&#x6613;&#x4E8E;&#x7BA1;&#x7406;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x533A;&#x57DF;&#x662F;&#x8868;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x987A;&#x5E8F;&#x8868;&#x521B;&#x5EFA;&#x540E;&#xFF0C;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x533A;&#x5C31;&#x56FA;&#x5B9A;&#x4E86;&#x3002;</p>
</li>
<li><p>&#x5206;&#x79BB;&#x5F0F;&#x7ED3;&#x6784;&#x8868;&#x5BF9;&#x8C61;&#x91CC;&#x53EA;&#x4FDD;&#x5B58;&#x4E0E;&#x6574;&#x4E2A;&#x8868;&#x6709;&#x5173;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x5373;&#x5BB9;&#x91CF;&#x548C;&#x5143;&#x7D20;&#x4E2A;&#x6570;&#xFF09;&#xFF0C;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x5143;&#x7D20;&#x5B58;&#x653E;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x533A;&#x91CC;&#xFF0C;&#x901A;&#x8FC7;&#x94FE;&#x63A5;&#x4E0E;&#x57FA;&#x672C;&#x8868;&#x5BF9;&#x8C61;&#x5173;&#x8054;&#x3002;</p>
<h3 id="3&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x533A;&#x66FF;&#x6362;">3).&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x533A;&#x66FF;&#x6362;</h3>
</li>
<li><p>&#x4E00;&#x4F53;&#x5F0F;&#x7ED3;&#x6784;&#x7531;&#x4E8E;&#x987A;&#x5E8F;&#x8868;&#x4FE1;&#x606F;&#x533A;&#x4E0E;&#x6570;&#x636E;&#x533A;&#x8FDE;&#x7EED;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6240;&#x4EE5;&#x82E5;&#x60F3;&#x66F4;&#x6362;&#x6570;&#x636E;&#x533A;&#xFF0C;&#x5219;&#x53EA;&#x80FD;&#x6574;&#x4F53;&#x642C;&#x8FC1;&#xFF0C;&#x5373;&#x6574;&#x4E2A;&#x987A;&#x5E8F;&#x8868;&#x5BF9;&#x8C61;&#xFF08;&#x6307;&#x5B58;&#x50A8;&#x987A;&#x5E8F;&#x8868;&#x7684;&#x7ED3;&#x6784;&#x4FE1;&#x606F;&#x7684;&#x533A;&#x57DF;&#xFF09;&#x6539;&#x53D8;&#x4E86;&#x3002;</p>
</li>
<li><p>&#x5206;&#x79BB;&#x5F0F;&#x7ED3;&#x6784;&#x82E5;&#x60F3;&#x66F4;&#x6362;&#x6570;&#x636E;&#x533A;&#xFF0C;&#x53EA;&#x9700;&#x5C06;&#x8868;&#x4FE1;&#x606F;&#x533A;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x533A;&#x94FE;&#x63A5;&#x5730;&#x5740;&#x66F4;&#x65B0;&#x5373;&#x53EF;&#xFF0C;&#x800C;&#x8BE5;&#x987A;&#x5E8F;&#x8868;&#x5BF9;&#x8C61;&#x4E0D;&#x53D8;&#x3002;</p>
<h3 id="4&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x533A;&#x6269;&#x5145;">4).&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x533A;&#x6269;&#x5145;</h3>
<p>&#x91C7;&#x7528;&#x5206;&#x79BB;&#x5F0F;&#x7ED3;&#x6784;&#x7684;&#x987A;&#x5E8F;&#x8868;&#xFF0C;&#x82E5;&#x5C06;&#x6570;&#x636E;&#x533A;&#x66F4;&#x6362;&#x4E3A;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x66F4;&#x5927;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x6539;&#x53D8;&#x8868;&#x5BF9;&#x8C61;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x5BF9;&#x5176;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x533A;&#x8FDB;&#x884C;&#x4E86;&#x6269;&#x5145;&#xFF0C;&#x6240;&#x6709;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x8868;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x4E0D;&#x5FC5;&#x4FEE;&#x6539;&#x3002;&#x53EA;&#x8981;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#xFF08;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#xFF09;&#x8FD8;&#x6709;&#x7A7A;&#x95F2;&#x5B58;&#x50A8;&#xFF0C;&#x8FD9;&#x79CD;&#x8868;&#x7ED3;&#x6784;&#x5C31;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x6EE1;&#x4E86;&#x800C;&#x5BFC;&#x81F4;&#x64CD;&#x4F5C;&#x65E0;&#x6CD5;&#x8FDB;&#x884C;&#x3002;&#x4EBA;&#x4EEC;&#x628A;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x7684;&#x987A;&#x5E8F;&#x8868;&#x79F0;&#x4E3A;&#x52A8;&#x6001;&#x987A;&#x5E8F;&#x8868;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x5BB9;&#x91CF;&#x53EF;&#x4EE5;&#x5728;&#x4F7F;&#x7528;&#x4E2D;&#x52A8;&#x6001;&#x53D8;&#x5316;&#x3002; <strong>&#x6269;&#x5145;&#x7684;&#x4E24;&#x79CD;&#x7B56;&#x7565;</strong></p>
</li>
<li><p>&#x6BCF;&#x6B21;&#x6269;&#x5145;&#x589E;&#x52A0;&#x56FA;&#x5B9A;&#x6570;&#x76EE;&#x7684;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#xFF0C;&#x5982;&#x6BCF;&#x6B21;&#x6269;&#x5145;&#x589E;&#x52A0;10&#x4E2A;&#x5143;&#x7D20;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#x53EF;&#x79F0;&#x4E3A;&#x7EBF;&#x6027;&#x589E;&#x957F;&#x3002; &#x7279;&#x70B9;&#xFF1A;&#x8282;&#x7701;&#x7A7A;&#x95F4;&#xFF0C;&#x4F46;&#x662F;&#x6269;&#x5145;&#x64CD;&#x4F5C;&#x9891;&#x7E41;&#xFF0C;&#x64CD;&#x4F5C;&#x6B21;&#x6570;&#x591A;&#x3002;</p>
</li>
<li><p>&#x6BCF;&#x6B21;&#x6269;&#x5145;&#x5BB9;&#x91CF;&#x52A0;&#x500D;&#xFF0C;&#x5982;&#x6BCF;&#x6B21;&#x6269;&#x5145;&#x589E;&#x52A0;&#x4E00;&#x500D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002; &#x7279;&#x70B9;&#xFF1A;&#x51CF;&#x5C11;&#x4E86;&#x6269;&#x5145;&#x64CD;&#x4F5C;&#x7684;&#x6267;&#x884C;&#x6B21;&#x6570;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x4F1A;&#x6D6A;&#x8D39;&#x7A7A;&#x95F4;&#x8D44;&#x6E90;&#x3002;&#x4EE5;&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;&#xFF0C;&#x63A8;&#x8350;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
</li>
</ul>
<h2 id="3python&#x4E2D;&#x7684;&#x987A;&#x5E8F;&#x8868;">3.python&#x4E2D;&#x7684;&#x987A;&#x5E8F;&#x8868;</h2>
<p>  Python&#x4E2D;&#x7684;list&#x548C;tuple&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x91C7;&#x7528;&#x4E86;&#x987A;&#x5E8F;&#x8868;&#x7684;&#x5B9E;&#x73B0;&#x6280;&#x672F;&#xFF0C;&#x5177;&#x6709;&#x524D;&#x9762;&#x8BA8;&#x8BBA;&#x7684;&#x987A;&#x5E8F;&#x8868;&#x7684;&#x6240;&#x6709;&#x6027;&#x8D28;&#x3002; tuple&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7C7B;&#x578B;&#xFF0C;&#x5373;&#x4E0D;&#x53D8;&#x7684;&#x987A;&#x5E8F;&#x8868;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x652F;&#x6301;&#x6539;&#x53D8;&#x5176;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x7684;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#xFF0C;&#x5219;&#x4E0E;list&#x7684;&#x6027;&#x8D28;&#x7C7B;&#x4F3C;&#x3002;</p>
<h3 id="list&#x7684;&#x57FA;&#x672C;&#x5B9E;&#x73B0;&#x539F;&#x7406;">list&#x7684;&#x57FA;&#x672C;&#x5B9E;&#x73B0;&#x539F;&#x7406;</h3>
<p>Python&#x6807;&#x51C6;&#x7C7B;&#x578B;list&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x5143;&#x7D20;&#x4E2A;&#x6570;&#x53EF;&#x53D8;&#x7684;&#x987A;&#x5E8F;&#x8868;&#xFF0C;&#x53EF;&#x4EE5;&#x52A0;&#x5165;&#x548C;&#x5220;&#x9664;&#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x5728;&#x5404;&#x79CD;&#x64CD;&#x4F5C;&#x4E2D;&#x7EF4;&#x6301;&#x5DF2;&#x6709;&#x5143;&#x7D20;&#x7684;&#x987A;&#x5E8F;&#xFF08;&#x5373;&#x4FDD;&#x5E8F;&#xFF09;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x884C;&#x4E3A;&#x7279;&#x5F81;&#xFF1A;</p>
<ul>
<li><p>&#x57FA;&#x4E8E;&#x4E0B;&#x6807;&#xFF08;&#x4F4D;&#x7F6E;&#xFF09;&#x7684;&#x9AD8;&#x6548;&#x5143;&#x7D20;&#x8BBF;&#x95EE;&#x548C;&#x66F4;&#x65B0;&#xFF0C;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5E94;&#x8BE5;&#x662F;O(1)&#xFF1B; &#x4E3A;&#x6EE1;&#x8DB3;&#x8BE5;&#x7279;&#x5F81;&#xFF0C;&#x5E94;&#x8BE5;&#x91C7;&#x7528;&#x987A;&#x5E8F;&#x8868;&#x6280;&#x672F;&#xFF0C;&#x8868;&#x4E2D;&#x5143;&#x7D20;&#x4FDD;&#x5B58;&#x5728;&#x4E00;&#x5757;&#x8FDE;&#x7EED;&#x7684;&#x5B58;&#x50A8;&#x533A;&#x4E2D;&#x3002;</p>
</li>
<li><p>&#x5141;&#x8BB8;&#x4EFB;&#x610F;&#x52A0;&#x5165;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x4E0D;&#x65AD;&#x52A0;&#x5165;&#x5143;&#x7D20;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8868;&#x5BF9;&#x8C61;&#x7684;&#x6807;&#x8BC6;&#xFF08;&#x51FD;&#x6570;id&#x5F97;&#x5230;&#x7684;&#x503C;&#xFF09;&#x4E0D;&#x53D8;&#x3002; &#x4E3A;&#x6EE1;&#x8DB3;&#x8BE5;&#x7279;&#x5F81;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x80FD;&#x66F4;&#x6362;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x533A;&#xFF0C;&#x5E76;&#x4E14;&#x4E3A;&#x4FDD;&#x8BC1;&#x66F4;&#x6362;&#x5B58;&#x50A8;&#x533A;&#x65F6;list&#x5BF9;&#x8C61;&#x7684;&#x6807;&#x8BC6;id&#x4E0D;&#x53D8;&#xFF0C;&#x53EA;&#x80FD;&#x91C7;&#x7528;&#x5206;&#x79BB;&#x5F0F;&#x5B9E;&#x73B0;&#x6280;&#x672F;&#x3002;</p>
</li>
</ul>
<p>&#x5728;Python&#x7684;&#x5B98;&#x65B9;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;list&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x91C7;&#x7528;&#x5206;&#x79BB;&#x5F0F;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x7684;&#x52A8;&#x6001;&#x987A;&#x5E8F;&#x8868;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x7528;list.append(x) &#xFF08;&#x6216; list.insert(len(list), x)&#xFF0C;&#x5373;&#x5C3E;&#x90E8;&#x63D2;&#x5165;&#xFF09;&#x6BD4;&#x5728;&#x6307;&#x5B9A;&#x4F4D;&#x7F6E;&#x63D2;&#x5165;&#x5143;&#x7D20;&#x6548;&#x7387;&#x9AD8;&#x7684;&#x539F;&#x56E0;&#x3002; &#x5728;Python&#x7684;&#x5B98;&#x65B9;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;list&#x5B9E;&#x73B0;&#x91C7;&#x7528;&#x4E86;&#x5982;&#x4E0B;&#x7684;&#x7B56;&#x7565;&#xFF1A;</p>
<pre><code class="lang-c"> <span class="hljs-comment">/* This over-allocates proportional to the list size, making room
     * for additional growth.  The over-allocation is mild, but is
     * enough to give linear-time amortized behavior over a long
     * sequence of appends() in the presence of a poorly-performing
     * system realloc().
     * The growth pattern is:  0, 4, 8, 16, 25, 35, 46, 58, 72, 88, ...
     */</span>
    new_allocated = (newsize &gt;&gt; <span class="hljs-number">3</span>) + (newsize &lt; <span class="hljs-number">9</span> ? <span class="hljs-number">3</span> : <span class="hljs-number">6</span>);

    <span class="hljs-comment">/* check for integer overflow */</span>
    <span class="hljs-keyword">if</span> (new_allocated &gt; PY_SIZE_MAX - newsize) {
        PyErr_NoMemory();
        <span class="hljs-keyword">return</span> -<span class="hljs-number">1</span>;
    } <span class="hljs-keyword">else</span> {
        new_allocated += newsize;
    }
</code></pre>
<p>&#x5728;&#x5EFA;&#x7ACB;&#x7A7A;&#x8868;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x5206;&#x914D;&#x4E00;&#x5757;&#x533A;&#x57DF;&#xFF0C;&#x5728;&#x6267;&#x884C;&#x63D2;&#x5165;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x5143;&#x7D20;&#x533A;&#x6EE1;&#x5C31;&#x6362;&#x4E00;&#x5757;&#x66F4;&#x5927;&#x7684;&#x5B58;&#x50A8;&#x533A;&#x3002;</p>
<blockquote>
<p>&#x4E0A;&#x9762;c&#x8BED;&#x8A00;&#x4EE3;&#x7801;&#x7684;&#x610F;&#x601D;&#x662F; &#x5982;&#x679C;&#x63D2;&#x5165;&#x65F6;&#x7533;&#x8BF7;&#x7684;&#x5B58;&#x50A8;&#x533A;&#x57DF;new_allocated&#x5927;&#x4E8E;&#x4E0A;&#x9650;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;-1&#xFF0C;&#x7533;&#x8BF7;&#x5931;&#x8D25;&#x3002; &#x5426;&#x5219; new_allocated += newsize&#x3002; &#x5982;&#x63D2;&#x5165;&#x7B2C;17&#x4E2A;&#x5143;&#x7D20;&#xFF0C;17 &gt;&gt; 3 &#x7684;&#x610F;&#x601D;&#x662F;&#x4F4D;&#x8FD0;&#x7B97;&#xFF0C;&#x7ED3;&#x679C;&#x4E3A;2&#xFF0C; <code>newsize &lt; 9 ? 3 : 6</code> &#x76F8;&#x5F53;&#x4E8E;python&#x4E2D; <code>newsize = 3 if newsize &lt; 9 else 6</code> <code>newsize = 6</code> &#x90A3;&#x4E48;&#x65B0;&#x533A;&#x57DF;&#x7684;&#x5927;&#x5C0F;&#x5C31;&#x662F; <code>17 + 2 + 6 = 25</code> *&#x6CE8; &#x5728;&#x67D0;&#x4E9B;&#x7F51;&#x7AD9;&#x6216;&#x4E66;&#x4E0A;&#x4ECB;&#x7ECD;python&#x7684;list&#x7ED3;&#x6784;&#x65F6;&#x8BF4; &#x4E00;&#x5F00;&#x59CB;&#x7A7A;&#x95F4;&#x662F;4&#xFF0C;&#x4E0D;&#x591F;&#x65F6;&#x4F1A;&#x4EE5;4&#x500D;&#x9012;&#x589E;&#xFF0C;&#x660E;&#x663E;&#x6709;&#x8BEF;&#x3002; </p>
</blockquote>
<footer class="page-footer"><span class="copyright">CopyRight&#xA9;2019 &#x54B8;&#x9C7C;&#x8D85;&#x4EBA; all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2019-03-16 00:15:17
</span></footer>
                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="../files/readme.html" class="navigation navigation-prev " aria-label="Previous page: 数据结构"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="../files/lianbiao.html" class="navigation navigation-next " aria-label="Next page: 链表"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="../gitbook/app.js"></script>

    
    <script src="../gitbook/plugins/gitbook-plugin-toggle-chapters/toggle.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-splitter/splitter.js"></script>
    

    
    <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-mcqx/js.cookie.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-mcqx/mcqx.js"></script>
    

    
    <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-sectionx/sectionx.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"tbfed-pagefooter":{"copyright":"CopyRight©2019 咸鱼超人","modify_label":"该文件修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"sectionx":{"tag":"b"},"toggle-chapters":{},"splitter":{},"emphasize":{},"mcqx":{},"katex":{},"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        <!-- body:end -->
    </body>
    <!-- End of book 数据结构 -->
</html>
